if GetLocale() == "zhTW" then
  local _, core = ...;
  local MonDKP = core.MonDKP;
  
  core.BossList = {
    MC = {
      "魯西弗隆", "瑪格曼達", "基赫納斯",
      "加爾", "迦頓男爵", "沙斯拉爾", "薩弗隆先驅者", 
      "『焚化者』古雷曼格", "管理者埃克索圖斯", "拉格納羅斯"
    },
    BWL = {
      "狂野的拉佐格爾", "墮落的瓦拉斯塔茲", "幼龍領主勒西雷爾",
      "費爾默", "埃博諾克", "弗萊格爾", "克洛瑪古斯", 
      "奈法利安"
    },
    AQ = {
      "預言者斯克拉姆", "戰地衛士沙爾圖拉", "不屈的范克里斯",
      "哈霍蘭公主", "雙子帝王", "克蘇恩", 
      "異種蠍皇族", "維希度斯", "奧羅"
    },
    NAXX = {
      "阿努比瑞克漢", "大寡婦費琳娜", "梅克絲娜",
      "『瘟疫使者』諾斯", "『不潔者』海根", "憎恨者", 
      "講師拉祖維斯", "『收割者』高希", "四騎士",
      "縫補者", "葛羅巴斯", "古魯斯", "泰迪斯",
      "薩菲隆", "科爾蘇加德"
    },
    ZG = {
      "Mandokir 勳爵", "加赫扎蘭卡", "哈克卡爾", "高普瑞特西卡爾", "高優先順序 Venoxis", "高普里斯特斯 - 阿洛克克",
      "高優先順序 Jeklik", "黑克瑟島", "高普里斯特斯 - 馬爾利", "瘋狂邊緣"
    },
    AQ20 = {
      "『狩獵者』阿亞米斯", "『暴食者』布魯", "拉賈克斯將軍", "庫林納克斯", "莫阿姆", "『無疤者』奧斯里安"
    },
    ONYXIA = {"奧妮克希亞"},
    WORLD = {
      "艾索雷苟斯", "卡札克領主", "艾莫莉絲", "雷索", "伊索德雷", "泰拉爾"
    }
  }
  
  core.ZoneList = {
    "熔火之心", "黑翼之巢", "安其拉神廟", "納克薩瑪斯", "祖爾格拉布", "安琪拉遺址", "奧妮西亞的巢穴", "世界老闆"
  }
end