if GetLocale() == "ruRU" then
  local _, core = ...;
  local MonDKP = core.MonDKP;
  
  core.BossList = {
    MC = {
      "Люцифрон", "Магмадар", "Гееннас",
      "Гарр", "Барон Геддон", "Шаззрах", "Предвестник Сульфурон", 
      "Големагг Испепелитель", "Мажордом Экзекутус", "Рагнарос"
    },
    BWL = {
      "Бритвосмерт Неукротимый", "Валестраз Порочный", "Предводитель драконов Разящий Бич",
      "Огнечрев", "Черноскал", "Пламегор", "Хромаггус", 
      "Нефариан"
    },
    AQ = {
      "Пророк Скерам", "Боевой страж Сартура", "Фанкрисс Непреклонный",
      "Принцесса Хухуран", "Императоры-близнецы", "К'Тун", 
      "Семейство жуков", "Нечистотон", "Оуро"
    },
    NAXX = {
      "Ануб'Рекан", "Великая вдова Фарлина", "Мексна",
      "Нот Чумной", "Хейган Нечестивый", "Лотхиб", 
      "Инструктор Разувий", "Готик Жнец", "Четыре Всадника",
      "Лоскутик", "Гроббулус", "Глут", "Таддиус",
      "Сапфирон", "Кел'Тузад"
    },
    ZG = {
      "Мандокир Повелитель Крови", "Газ'ранка", "Хаккар", "HВерховный жрец Текал", "Верховный жрец Веноксис", "Верховная жрица Арлокк",
      "Верховная жрица Джеклик", "Мастер проклятий Джин'до", "Верховная жрица Мар'ли", "Край безумия"
    },
    AQ20 = {
      "Аямисса Охотница", "Буру Ненасытный", "Генерал Раджакс", "Куриннакс", "Moam", "Оссириан Неуязвимый"
    },
    ONYXIA = {"Ониксия"},
    WORLD = {
      "Azuregos", "Лорд Каззак", "Эмерисс", "Lethon", "Ysondre", "Таэрар"
    }
  }
  
  core.ZoneList = {
    "Расплавленное ядро", "Логово Крыла Тьмы", "Храм Ан'Киража", "Наксарамас", "Зул'Гуруб", "Руины Ан'Киража", "Логово Ониксии", "Мировые Боссы"
  }
end