if GetLocale() == "zhCN" then
  local _, core = ...;
  local MonDKP = core.MonDKP;
  
  core.BossList = {
    MC = {
      "鲁西弗隆", "玛格曼达", "基赫纳斯",
      "加尔", "迦顿男爵", "沙斯拉尔", "萨弗隆先驱者", 
      "焚化者古雷曼格", "管理者埃克索图斯", "拉格纳罗斯"
    },
    BWL = {
      "狂野的拉佐格尔", "堕落的瓦拉斯塔茲", "勒什雷尔",
      "费尔默", "埃博诺克", "弗莱格尔", "克洛玛古斯", 
      "奈法利安"
    },
    AQ = {
      "预言者斯克拉姆", "沙尔图拉", "顽强的范克瑞斯",
      "哈霍兰公主", "双子皇帝", "克苏恩", 
      "异种蝎皇族", "维希度斯", "奥罗"
    },
    NAXX = {
      "阿努布雷坎", "黑女巫法琳娜", "迈克斯纳",
      "瘟疫使者诺斯", "肮脏的希尔盖", "洛欧塞布", 
      "教官拉苏维奥斯", "收割者戈提克", "四骑士",
      "帕奇维克", "格罗布鲁斯", "格拉斯", "塔迪乌斯",
      "萨菲隆", "克尔苏加德"
    },
    ZG = {
      "血领主曼多基尔", "加兹兰卡", "噬魂者哈卡", "高阶祭司塞卡尔", "高阶祭司温诺希斯", "高级祭祀阿罗可可",
      "高阶祭司耶克里克", "妖术师金度", "高阶祭司玛尔里", "疯狂之缘"
    },
    AQ20 = {
      "『狩猎者』阿亚米斯", "『暴食者』布鲁", "拉贾克斯将军", "库林纳克斯", "莫阿姆", "『无疤者』奥斯里安"
    },
    ONYXIA = {"奥妮克希亚"},
    WORLD = {
      "艾索雷苟斯", "卡札克领主", "艾莫莉丝", "雷索", "伊索德雷", "泰拉尔"
    }
  }

  core.ZoneList = {
    "熔火之心", "黑翼巢穴", "安其拉神庙", "纳克萨玛斯", "祖尔古鲁布", "安其拉废墟", "奥妮克希亚的巢穴", "世界老板"
  }
end